# RenderLibNotInstalledWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RenderFailures..::..RenderLibNotInstalledWarn Property
BuiltInFailures..::..RenderFailures Class See Also
---
Rendering library has not been installed, so the third party geometry cannot be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RenderLibNotInstalledWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RenderLibNotInstalledWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RenderLibNotInstalledWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RenderFailures Class
Autodesk.Revit.DB Namespace